/**
 * 
 * 
 * 
 *  第一章 HTTP概述问题
 *      需要实操一下 发送HTTP请求到服务端 
 *          发送请求报文
 *             起始行 首部字段 主体
 * 
 * 
 *  缓存部分问题
 *      IF-None-Match实体标签验证 
 *          由服务端发起的吗？发起的标志是什么 中间商怎么能知道是不是要用实体标签来做缓存校验
 *          同Last-Modified吗？
 *      HTTP/1.1和HTTP/1.0缓存还不一样吗
 *      客户端怎么强制不接受缓存或者选择缓存类型呢？
 *      服务端即设置了 Cache-Control:no-store或者Cache-Control:no-cache又设置了 Expires Cache-control: max-age怎么处理呢 
 *      
 *      缓存配置需要在程序中跑一下 看下具体的缓存策略是什么意思
 *      具体的组合使用缓存是什么情况 各种组合代表的含义
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 





*/