/**
 *  21 | Chrome开发者工具：利用网络面板做性能分析
 * 
 *  Chrome开发工具
 *      Elements
 *          可以查看DOM结构，编辑CSS样式，用于测试页面布局和设计页面
 *      Console
 *          可以看成是JS Shell，能执行JS脚本，通过Console能和页面中的JS对象进行交互
 *      Sources
 *          查看web应用加载的所有文件
 *          编辑CSS和JS文件内容
 *          将打乱的CSS和JS格式化
 *          支持JS调试功能
 *          设置工作区，将更改的文件保存到本地文件夹中
 *      NetWork面板
 *          展示了页面中所有的请求内容列表，能查看每行请求的请求行，请求头，请求体，时间线以及网络请求瀑布图等信息         
 *      Performance
 *          记录和查看Web应用生命周期内的各种事件，并用来分析在执行过程中一些影响性能的要点
 *      Memory
 *          用于查看运行过程中的JS占用堆内存的情况，追踪是否存在内存泄漏的情况
 *      Appplication
 *          查看Web页面的数据存储情况
 *          PWA的基础数据，indexedDB;Web SQL；本地会话与存储；Cookie;应用程序缓存;图像;字体和样式表等
 *      Security
 *          显示当前页面的一些基础安全信息
 *      Audits
 *          会对当前页面进行网络利用情况、网页性能方面的诊断，并给出一些优化建议
 *      Layers
 *          展示一些渲染过程中分层的基础信息
 *   
 *  NetWork网络面板(图 ./i/网络面板概要图.png)
 *      控制器(图 ./i/控制器概要图.png)
 *          
 *       
**/